Autodesk.Revit.DB.Analysis.HVACLoadType.DehumidificationSetPoint
The dehumidification set point as a number between 0 and 1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2021.1

Autodesk.Revit.DB.Analysis.HVACLoadType.HumidificationSetPoint
The humidification set point as a number between 0 and 1.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2021.1

Autodesk.Revit.DB.Analysis.HVACLoadType.CoolingSetPoint
The cooling temperature set point in unit Kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2021.1

Autodesk.Revit.DB.Analysis.HVACLoadType.HeatingSetPoint
The heating temperature set point in unit Kelvin (K).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2021.1